# IDA: Assignment 3

### Deadline: Thursday - October 28 - until 23:59


**Instructions:** All answers should be provided in the notebook and then submitted to Moodle. Name of notebook should be in following format:
 - Name_group_Assignment3.ipynb (ex. Mike_Tyson_2009_Assignment1.ipynb). PLEASE, use exactly the **same format.**
 - Try to use fewer cells for compilation (for example, you can use print for several answers, instead of printing each answer on a separate cell)
 - **PLEASE:** submit only one jupyter notebook (no zip or csv files) and with your names as in the instruction. Ohterwise, there will be punishment of 30% from your assignment mark.
 - **IMPORTANT NOTE:** you will get points only for correct answers, not for trials or wrong answers. Your notebook should run when we press **"Restart Kernel"** and then press **"Run All"**. We are going to check answers only after doing that. If your code do not compile and stops at any question, you will get zero for that question.

In [1]:
import pandas as pd
import numpy as np

## Q1 (20%)
In the **orders** dataset below, answer the following four tasks (5% each):
1. Find five most commonly ordered (don't take quantity into account) items along with number of orders;
2. Find five most commonly sold (take quantity into account) items along with quantity sold;
3. Find five most commonly ordered items with choice description missed (i.e. NaN) along with their count;
4. Find five most revenue generating items along with revenue generated.

For all tasks no need to split item_name values, assume that those are the items and item pairs available in menu (i.e. there are 50 unique positions). For task three you need to create additional column. Use .head() to show the result of each question. 

***Note: You will get full points only in case of having correct answer for each task. No points for trials and wrong answers.***

In [2]:
orders = pd.read_table('http://bit.ly/chiporders')
orders.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [3]:
# just showing that there are 50 positions
orders.item_name.nunique()

50

In [4]:
# 1. 
orders['item_name'].value_counts().head()

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Steak Burrito          368
Canned Soft Drink      301
Name: item_name, dtype: int64

In [5]:
# 2. 
orders[['item_name','quantity']].groupby('item_name').sum().sort_values(by='quantity', ascending=False).head()

                     quantity
item_name
Chicken Bowl              761
Chicken Burrito           591
Chips and Guacamole       506
Steak Burrito             386
Canned Soft Drink         351

In [6]:
# 3.
orders[orders.choice_description.isnull()].groupby('item_name').count().sort_values(by = 'item_price', ascending=False).head(5)

,order_id,quantity,choice_description,item_price
item_name,,,,
Chips and Guacamole,479,479,0,479
Chips,211,211,0,211
Bottled Water,162,162,0,162
Chips and Fresh Tomato Salsa,110,110,0,110
Side of Chips,101,101,0,101

In [7]:
# 4.
orders['revenue'] = orders.item_price*orders.quantity
orders[['item_name','quantity', 'item_price', 'revenue']].groupby(['item_name', 'item_price','revenue']).sum().sort_values(by='revenue', ascending=False).head()

                                          quantity
item_name             item_price revenue
Steak Salad Bowl      $9.39      $9.39          10
Barbacoa Salad Bowl   $9.39      $9.39           5
Carnitas Salad Bowl   $9.39      $9.39           2
Carnitas Soft Tacos   $9.25      $9.25          31
Carnitas Crispy Tacos $9.25      $9.25           2

## Q2 (20%)
In the **drinks** dataset below, answer the following four tasks (5% each):

1. Find list/table of "STAN" contries (such as Kazazhstan) that has non-zero alcohol consumption (use total_litres_of_pure_alcohol);
2. In Europe, find a country with the highest spirit servings, but with total_litres_of_pure_alcohol level below 5; 
3. In Asia, find countries that are on 4th place in alcohol consumption;
4. Find countries which are on 5th, 10th and 15th places in total number of servings (sum of three serving types).

***Note: You will get full points only in case of having correct answer for each task. No points for trials and wrong answers.***

In [8]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [9]:
import numpy as np
pd.Series(np.Nan)

AttributeError: module 'numpy' has no attribute 'Nan'

In [ ]:
drinks.count(axis=0)

In [ ]:
# 1
drinks[drinks.total_litres_of_pure_alcohol != 0.0].sort_values(by='country', ascending=True).head()

In [ ]:
# 2
drinks[(drinks.continent=='Europe') & 
       (drinks.total_litres_of_pure_alcohol < 5.0) &
       (drinks.spirit_servings.sort_values(ascending=False))].head(1)

In [ ]:
# 3
drinks['total_litres_of_pure_alcohol'] = drinks.total_litres_of_pure_alcohol.astype(int)
drinks[(drinks.continent=='Asia') & 
       (drinks.total_litres_of_pure_alcohol)].sort_values(by = 'total_litres_of_pure_alcohol',ascending=False)[3:4]

In [ ]:
# 4
drinks['Total']= drinks.iloc[:, 1:4].sum(axis=1)
drinks[['country','Total']].sort_values(by = 'Total',ascending=False)[4:15:5]

## Q3 (20%)
In the **ufo** dataset below, find top 10 locations, in which there were the most frequent number of ufo reports during the period starting from 1980. Show the location and number of reports in one dataframe as an answer. Note that there could be a city name in two states, for example, there is a city Phoenix in NY and in AZ.

***Note: You will get full points only in case of having correct answer for each task. No points for trials and wrong answers.***

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

In [ ]:
ufo[ufo.City == 'Phoenix'].State.unique()

In [ ]:
# please, write your code here
ufo['Time'] = pd.to_datetime(ufo.Time)
ts = pd.to_datetime('1/1/1980')
(ufo.loc[ufo.Time >= ts, :]).head()

ufo['Location'] = ufo.City + ', ' + ufo.State
ufo[['Location','Colors Reported','Shape Reported','Time']].value_counts().head(10)

## Q4 (20%)
In the **movies** (IMBD ratings) dataset below, find Top 6 actors that the most frequently appeared in the movies from the dataset. 

Then create a dataframe with two columns: Full name of an actor and Number of movies he/she was listed within this dataset. Finally, show the top 12 actors with corresponding frequencies using .head().

***Note: You will get full points only in case of having correct answer for each task. No points for trials and wrong answers.***

***Hint: you might need to use numpy and creation of lists, but it depends on your approach.***

In [ ]:
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

In [ ]:
# please, write your code here
movies.actors_list = movies.actors_list.apply(lambda z: eval(z))

movies.actors_list.apply(lambda z: pd.Series(z).value_counts()).sum().sort_values(ascending = False).head(12)

## Q5 (20%)
In the **movies** (IMBD ratings) dataset below, apply **discretization transformation** on the duration column. It means to create a new column with duration categories with 30 minutes step such as: 60-89.99, 90-119.99, 120-149.99 and so on until you will cover the movie with the longest duration. 

Then for each duration category find a movie with the highest star_rating along with its title and actual duration (i.e. no need to show content_rating, actors_list, genre). Save it in one dataframe sorted by duration in an ascending order.

***Note: You will get full points only in case of having correct answer for each task. No points for trials and wrong answers.***

***Hint: you might need to use methods .drop() and .merge(), but it depends on your approach.***

In [ ]:
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

In [ ]:
# please, write your code here

# movies.duration.sort_values()
discretization_transformation = np.arange(60, movies['duration'].max() + 30, 30)
movies['discretization_transformation'] = pd.cut(movies['duration'], bins=discretization_transformation)
movies.sort_values(by = 'discretization_transformation', ascending = True)
movies1 = movies[['discretization_transformation', 'star_rating', 'title', 'duration']].groupby(by = ['discretization_transformation']).max('star_rating')
sorting = movies.loc[movies.groupby(by = ['discretization_transformation'])['star_rating'].idxmax()].sort_values(by = ['duration'], ascending = True)
sorting.head(10)

---

### Evaluation (Keep it!)

| Question | Mark     | Comment   
|:-------:|:--------:|:----------------------
| 1       |   20/20    |     
| 2       |   20/20    | 
| 3       |   20/20    | 
| 4       |   20/20    | 
| 5       |   20/20    | 
|**Total**|**100/100**  |